Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>удалить</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Курс считается отностительно базовой валюты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВИнвойсах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВОплатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодISO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Валюты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли;   
	// © Primus1C  06.07.2023  НАЧАЛО ►
	Фирма = гоФирма();      
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЦвет(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	
	Кра = 0; 
	Зел = 0;
	Син = 0;
	гоЦветОбратно(Объект.Цвет, Кра, Зел, Син);
	
	Диалог = Новый ДиалогВыбораЦвета;
	Диалог.Цвет = Новый Цвет(Кра, Зел, Син);
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьЦветПослеВыбора", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЦветПослеВыбора(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда Возврат КонецЕсли;
	НовЦвет = гоЦвет(РезультатВыбора.Красный, РезультатВыбора.Зеленый, РезультатВыбора.Синий);
	Если НовЦвет = Объект.Цвет Тогда Возврат КонецЕсли;
	
	Объект.Цвет = НовЦвет;
	ЭтаФорма.Модифицированность = Истина;
	Покрасить();
КонецПроцедуры

&НаКлиенте
Процедура Покрасить()
	Кра = 0; 
	Зел = 0;
	Син = 0;
	гоЦветОбратно(Объект.Цвет, Кра, Зел, Син);
	Цвет = Новый Цвет(Кра, Зел, Син);
	
	Элементы.Цвет_.ЦветФона = Цвет;
	Элементы.Цвет_.ЦветФонаЗаголовка = Цвет;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Покрасить();  
	// © Primus1C  08.07.2023  НАЧАЛО ►
	ОтобразитьБазовуюВалюту(); 
	ОтобразитьЦвет(); 
	ОбратныйКурсПриИзменении(Неопределено);
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

// © Primus1C  06.07.2023  НАЧАЛО ►

&НаКлиенте
Процедура БазоваяВалютаПриИзменении(Элемент) 
	
	ОтобразитьБазовуюВалюту();  
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтобразитьБазовуюВалюту()
	
	Если Элементы.Найти("ФирмаВалюта") <> Неопределено Тогда
		Элементы.ФирмаВалюта.Видимость = НЕ ЗначениеЗаполнено(Объект.БазоваяВалюта);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЦветРГБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	УстановитьНовыйЦветКлиент(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыйЦветКлиент(Элемент, СтандартнаяОбработка)

    Элемент_Имя     = Элемент.Имя;

    ТекущийЦвет     = Объект[Элемент_Имя];

    ТекПараметры    = Новый Структура("ТекущийЦвет", ТекущийЦвет);

    ОткрытьФорму("Обработка.ДиалогВыбораЦвета.Форма.Форма", ТекПараметры, ЭтаФорма, , , , 
		Новый ОписаниеОповещения("УстановитьНовыйЦветКлиентПослеВыбора", ЭтотОбъект, Элемент_Имя));

    СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыйЦветКлиентПослеВыбора(ВыбранныйЦвет, Элемент_Имя) Экспорт

    Если Не ВыбранныйЦвет = Неопределено Тогда

        Объект[Элемент_Имя] = ВыбранныйЦвет;

    КонецЕсли;
	
	ОтобразитьЦвет();
	
КонецПроцедуры

 &НаКлиенте
 Процедура ОтобразитьЦвет()
	 
	мас = СтрРазделить(Объект.ЦветРГБ, ",");
	Если мас[0] = "" Тогда
		Элементы.ДекорацияЦвет.ЦветФона = Новый Цвет(255,255,255);
	Иначе
 		Элементы.ДекорацияЦвет.ЦветФона = Новый Цвет(Число(мас[0]), Число(мас[1]), Число(мас[2]));  
	КонецЕсли; 
 
 КонецПроцедуры
 
&НаКлиенте
Процедура ЦветРГБПриИзменении(Элемент) 
	
	ОтобразитьЦвет(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбратныйКурсПриИзменении(Элемент) 
	
	лФирма = омСервер.ПолучитьПараметрСеанса("Фирма");
	лКурс = омСервер.Курс(Объект.Ссылка, лФирма, ТекущаяДата());
	лБазоваяВалюта = ?(ЗначениеЗаполнено(Объект.БазоваяВалюта), 
						Объект.БазоваяВалюта,
						ВалютаФирмы(лФирма));
	
	Если Объект.ОбратныйКурс Тогда
		стр = СтрШаблон("вносится курс базовой валюты относительно %1:
						|1 %2 = %3 %1", 
						Объект.Код, лБазоваяВалюта, лКурс);
	Иначе
		стр = СтрШаблон("курс %1 вносится относительно базовой:
						|1 %1 = %2 %3", Объект.Код, лКурс, лБазоваяВалюта);
	КонецЕсли; 
	
	Элементы.ДекорацияИнфо.Заголовок = стр;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВалютаФирмы(Фирма)

	Возврат Фирма.Валюта;	

КонецФункции 

// © Primus1C  ОКОНЧАНИЕ ◄
